In [53]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from scipy.stats import skew
from scipy.stats import kurtosis

In [19]:
a ={'Name':['a','b','c','d','e','f','g','h','i','j'],
   'Salary':[200000,500000,700000,350000,190000,300000,300000,410000,550000,60200],
   'Country':['USA','UK','UK','India','China','USA','India','Brazil','Italy','France']}
df = pd.DataFrame(a)

In [20]:
df.to_csv('data', index = False)

In [21]:
Data = pd.read_csv('data')
Data

  Name  Salary Country
0    a  200000     USA
1    b  500000      UK
2    c  700000      UK
3    d  350000   India
4    e  190000   China
5    f  300000     USA
6    g  300000   India
7    h  410000  Brazil
8    i  550000   Italy
9    j   60200  France

In [22]:
print(Data['Salary'].mean())
print(Data['Salary'].mode())
print(Data['Salary'].median())

356020.0
0    300000
dtype: int64
325000.0

In [27]:
print(Data['Salary'].var())
print(Data['Salary'].std())

36146848444.44444
190123.24540793122

In [29]:
print(Data['Salary'].sum())
print(Data['Salary'].max())
print(Data['Salary'].min())
print(Data['Salary'].count())

3560200
700000
60200
10

In [32]:
Data.groupby('Country')['Salary'].sum()

Country
Brazil     410000
China      190000
France      60200
India      650000
Italy      550000
UK        1200000
USA        500000
Name: Salary, dtype: int64

In [33]:
Data.groupby(['Country']).count()

         Name  Salary
Country
Brazil      1       1
China       1       1
France      1       1
India       2       2
Italy       1       1
UK          2       2
USA         2       2

In [36]:
Data['Salary'].skew(axis= 0, skipna = True) # the skewness is positive so the data is positively skewed

0.33404633600565425

In [45]:
bw = pd.read_csv("C:/Users/Admin/Desktop/Savri/FDS/Datasets/BirthWeight.csv")
bw.head()

   Infant ID  Gestational Age (Weeks)  Birth Weight (Grams)
0          1                     34.7                  1895
1          2                     36.0                  2030
2          3                     29.3                  1440
3          4                     40.1                  2835
4          5                     35.7                  3090

In [46]:
bw.set_index('Infant ID', inplace = True)

In [44]:
bw.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 17 entries, 1 to 17
Data columns (total 2 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Gestational Age (Weeks)  17 non-null     float64
 1   Birth Weight (Grams)     17 non-null     int64
dtypes: float64(1), int64(1)
memory usage: 408.0 bytes

In [47]:
bw.cov()

                         Gestational Age (Weeks)  Birth Weight (Grams)
Gestational Age (Weeks)                 9.963824              1798.025
Birth Weight (Grams)                 1798.025000            485478.750

In [50]:
bw.corr(method = 'kendall')

                         Gestational Age (Weeks)  Birth Weight (Grams)
Gestational Age (Weeks)                 1.000000              0.577778
Birth Weight (Grams)                    0.577778              1.000000

In [51]:
bw.corr()

                         Gestational Age (Weeks)  Birth Weight (Grams)
Gestational Age (Weeks)                 1.000000              0.817519
Birth Weight (Grams)                    0.817519              1.000000

In [52]:
# Covariance tells us that there is a positive relation between the gestational age and birth weight 
# correlation tells us there is a strong positive relation between the two.

In [54]:
pd.set_option("display.max_columns",None) # to display all the columns
pd.options.display.float_format = "{:,.2f}".format # to display floating numbers upto 2 decimal points

In [55]:
diamond = pd.read_csv("C:/Users/Admin/Desktop/Savri/FDS/Datasets/diamonds.csv")

In [57]:
diamond.head()

   id  carat      cut color clarity  depth  table  price    x    y    z
0   1   0.23    Ideal     E     SI2  61.50  55.00    326 3.95 3.98 2.43
1   2   0.21  Premium     E     SI1  59.80  61.00    326 3.89 3.84 2.31
2   3   0.23     Good     E     VS1  56.90  65.00    327 4.05 4.07 2.31
3   4   0.29  Premium     I     VS2  62.40  58.00    334 4.20 4.23 2.63
4   5   0.31     Good     J     SI2  63.30  58.00    335 4.34 4.35 2.75

In [59]:
diamond_df = diamond.drop(['id'],axis= 1)
for col in diamond_df:
    if diamond_df[col].dtype == 'object':
        diamond_df = diamond_df.drop([col],axis =1)

diamond_df1 = diamond_df.describe()
diamond_df1 = diamond_df1.rename(index ={"50%":'median/50%'})
diamond_df1
# variance can be added to the following output

,carat,depth,table,price,x,y,z
count,"53,940.00","53,940.00","53,940.00","53,940.00","53,940.00","53,940.00","53,940.00"
mean,0.80,61.75,57.46,"3,932.80",5.73,5.73,3.54
std,0.47,1.43,2.23,"3,989.44",1.12,1.14,0.71
min,0.20,43.00,43.00,326.00,0.00,0.00,0.00
25%,0.40,61.00,56.00,950.00,4.71,4.72,2.91
median/50%,0.70,61.80,57.00,"2,401.00",5.70,5.71,3.53
75%,1.04,62.50,59.00,"5,324.25",6.54,6.54,4.04
max,5.01,79.00,95.00,"18,823.00",10.74,58.90,31.80